#dict是字典的缩写
#set是集合的缩写
#python中的元祖用小括号表示
#列表中中括号表示
#字典和集合用大括号
#比如同样描述一个学生信息
stu=("001","小小","nan",23)
#元祖和数组的区别：
#数组可以修改元素的内容，但是不能增加和删除，数组中所有的元素类型一样
#元祖不能增删改，元祖的类型不固定

stu=["001","小小","nan",23]
#元祖和列表的区别：
#元祖是只读，不能修改
#列表是可以进行增删改查的，最常用的数据格式
#find_elements()返回的是列表


stu={"001","小小","nan",23}
#元祖和集合的区别
#1，集合是无序的，不能用下标（索引）的方式查找元素
#2，集合是不可重复的，重复的元素会自动删除


stu={"id":"001","姓名":"小毛","性别":"男","年龄":23,"成绩":23}
#字典和集合的区别：
#冒号前边的叫做key，后边的部分叫做value
#字典是自我描述性的，你看见的key值，就知道value所代表的意思了
#集合中的key不能重复，value值可以重复
#集合是无序的
print(stu['id'])









